@if(!empty($comments) && is_object($comments) && $comments->isNotEmpty())
    {{dump($comments)}}
    <ul id="post-list" class="post-list">
        <hr>
        <div><p>Комментарии ({{ $comments->count() }})</p></div>
        @foreach($comments as $comment)
            @if(0 != $comment->parent_id)
                @continue
            @endif
            <li>
                <div class="post-content">
                    <div class="avatar-time">
                        <span>{{ $comment->name }}</span>
                        <time>11 Март 2017, 22:35</time>
                    </div>
                    <p>О, да!!! Это Специалист))) <br>
                        Позитивный человечек с врождённым чувством прекрасного и большим желанием
                        сделать всех вокруг красивыми и счастливыми)))
                    </p>
                    <div class="content-answer">
                        <a href="#">ответ</a>
                    </div>

                </div>

                {{--<ul class="children">--}}
                {{--<li class="childrens">--}}
                {{--<div class="post-content">--}}
                {{--<div class="avatar-time">--}}
                {{--<span>Мария</span>--}}
                {{--<time>11 Март 2017, 22:35</time>--}}
                {{--</div>--}}
                {{--<p>О, да!!! Это Специалист))) <br>--}}
                {{--Позитивный человечек с врождённым чувством  прекрасного и большим желанием--}}
                {{--сделать всех вокруг красивыми и счастливыми)))--}}
                {{--Позитивный человечек с врождённым чувством  прекрасного и большим желанием--}}
                {{--сделать всех вокруг красивыми и счастливыми)))--}}
                {{--</p>--}}

                {{--</div>--}}
                {{--</li>--}}
                {{--<li class="childrens">--}}
                {{--<div class="post-content">--}}
                {{--<div class="avatar-time">--}}
                {{--<span>Мария</span>--}}
                {{--<time>11 Март 2017, 22:35</time>--}}
                {{--</div>--}}
                {{--<p>О, да!!! Это Специалист))) <br>--}}
                {{--Позитивный человечек с врождённым чувством  прекрасного и большим желанием--}}
                {{--сделать всех вокруг красивыми и счастливыми)))--}}
                {{--</p>--}}

                {{--</div>--}}
                {{--</li>--}}
                {{--<li class="childrens">--}}
                {{--<div class="post-content">--}}
                {{--<div class="avatar-time">--}}
                {{--<span>Мария</span>--}}
                {{--<time>11 Март 2017, 22:35</time>--}}
                {{--</div>--}}
                {{--<p>О, да!!! Это Специалист))) <br>--}}
                {{--Позитивный человечек с врождённым чувством  прекрасного и большим желанием--}}
                {{--сделать всех вокруг красивыми и счастливыми)))--}}
                {{--</p>--}}

                {{--</div>--}}
                {{--</li>--}}
                {{--</ul>--}}

            </li>
        @endforeach
    </ul>
@endif